// 返回值的3种形式
// 1.提前返回要用return
// 2.如果最后一行加了;，表示该行为返回值
// 3.如果不符合前面两个条件，则返回最后一行
fn pi() -> f64 { 
    3.1415926535897932384626433832795028841971693993751058209749445923078164062862089986280348253421170679821480865132823066470938446095505822317253594081284811174502841027019385211055596446229489549303819644288109756659334461284756482
}

fn pi2() {
    3.1415926535897932384626433;
}

fn pi3() -> i32 {
    return 666; 
    3.1415926535897932384626433;
}

fn apply(value: i32, f: fn(i32) -> i32) -> i32 {
    f(value)
}

fn square(value: i32) -> i32 {
    value * value
}

fn cube(value: i32) -> i32 {
    value * value * value
}

fn main() {
    println!("Square,: {}", apply(5, square));
    println!("Cube,: {}", apply(5, cube));
    println!("PI1,: {}", pi());
    println!("PI2,: {:?}",pi2());
    println!("PI3,: {}", pi3());
}
